/*
    Система ролей працює таким чином: при створенні команди вписуються назви ролей, які мають доступ до команди.
    Тобто тут список ролей має суто описовий характер, для розуміння того які є ролі, щоб можна було отримувати списики ролей ітп

    Також є роль власника, яка не тут вказана. Власник вказується серед environment variables
*/

export const roles_map: RolesMap = {
    tech: {
        name: 'Технічна команда',
        description: 'Майже найвищий рівень доступу. Можна видаляти, редагувати пісні. Але не можна змінювати доступи для інших користувачив та ще деякі спец штуки'
    },
    worship: {
        name: 'Група прославлення',
        description: 'Майже найвищий рівень доступу. Можна видаляти, редагувати пісні. Але не можна змінювати доступи для інших користувачив та ще деякі спец штуки'
    }
}